<?php

$questionSet            =  [

[
"question" => "সঞ্চিতা- কোন কবির কাব্য সংকলন?",
"option"   => ["রবীন্দ্রনাথ ঠাকুর",  "সত্যেন্দ্রনাথ দত্ত","কাজী  নজরুল ইসলাম","সুফিয়া আহম্মেদ"]

],

[
"question" => "কোন বানানটি শুদ্ধ?",
"option"   => ["সূচিষ্মিতা","সূচিস্মিতা সূ","চীস্মিতা","সুচিস্মিতা"]

],


[
"question" => "ঘুম থেকে জেগে  বৈশাখি ঝড়ে কুড়ায়েছি  ঝড়া আম’ এই লাইনটির লেখক  বা  কবি কে?",
"option"   => ["বঙ্কিমচন্দ্র চট্টোপাধ্যায়","সানাউল  হক","বেগম সুফিয়া কামাল", "সুফিয়া আহম্মেদ"]

],



[
"question" => "কোনটি তদ্ভব  শব্দ ?",
"option"   => ["চাঁদ","সূর্য","গগন","নক্ষত্র"]

],



[
"question" => "ভাষার ক্ষুদ্রতম একক কোন্টি?",
"option"   => ["বর্ণ","শব্দ","অক্ষর","ধ্বনি"]

],


[
"question" => "কবি গানের প্রথম কবি –",
"option"   => ["গোজলা পুট","হরু ঠাকুর","ভবানী ঘোষ","নিতাই বৈরাগী"]

],


[
"question" => "বাঙ্গালা ভাষার ইতিবৃত্ত’ কে রচনা করেন?",
"option"   => ["সুনীতিকুমার চট্টোপাধ্যায়", "সুকুমার সেন","মুহম্মদ শহীদুল্লাহ্‌", "মুহম্মদ এনামুল হক"]

],

[
"question" => "কোনোদিন কর্মহীন পূর্ণ  অবকাশে  বসন্ত বাতাসে অতীতের  তীর  হাতে যে  রাত্রে বহীবে দীর্ঘশ্বাস, ঝরা বকুলের কান্না ব্যথিবে আকাশ। উপরিউক্ত চরণের রচয়িতা কে?",
"option"   => ["শামসুর রাহমান","রবীন্দ্রনাথ ঠাকুর","কাজী নজরুল ইসলাম","কোনটিই নয়"]

],


[
"question" => "কোন বাক্যে ক্রিয়া পদ উহ্য রয়েছে?",
"option"   => ["তিনি সাঁতার কাটছেন","ইনি আমার ভাই","কবির বই পড়ছে",   "আমি লিখছি"]

],


[
"question" => "ক্রিয়া সম্পাদনের যন্ত্র,উপকরণ বা সহায়ককে কি বলে?",
"option"   => ["সৈয়দ শামসুল হক","মোহাম্মদ মনিরুজ্জামান","আব্দুল মান্নান","সৈয়দ আল মাহমুদ"]

],

];

foreach ($questionSet as $key => $singleQestion) {
    // echo $singleQestion["question"]."<br>";
    // if($singleQestion["option"]){
        foreach ($singleQestion as $key => $singelValue) {
            
        // }
}
echo $singelValue[1]."<br>";
}
?>